// JavaScript Document
var date=[	
	{
		message:"2020 - 04 - 03",
		reply:"修复一个只会出现在mac电脑Chrome浏览器上的陈年老bug"
	},
	{
		message:"2019 - 10 - 09",
		reply:"文章列表页修改时间展示格式样式"
	},
	{
		message:"2019 - 07 - 01",
		reply:"修复二级菜单bug"
	},
	{
		message:"2019 - 06 - 24",
		reply:"1、修改移动端左侧导航，和PC端同步，由后台一次性配置；2、修改微信图片后台配置前端未正确加载；3、修改移动端主题背景色"
	},
	{
		message:"2019 - 06 - 07",
		reply:"优化项目结构，之前单页分类等所有页面都是通过新建分类形式划分，其实是不合理的，孤立的单页应该在新建页面下划分"
	},
	{
		message:"2019 - 06 - 05",
		reply:"重要更新：摒弃之前导航需要在header.php文件中设置，采用新的方式，在后台>外观>菜单中配置即可，保留原导航特效！"
	},
	{
		message:"2019 - 06 - 04",
		reply:"依照小伙伴意愿，修改分类列表缩略图调用逻辑，默认取自己文章中设定的特色图片，如果没设置，将获取对应文章中的第一张图片，如果当前文章没有图片，将展示主题自带的一张固定的图片作为列表缩略图"
	},
	{
		message:"2019 - 06 - 02",
		reply:"根据网站后台配置设置自己的标题，因此使用主题的过程中，请配置好自己的主标题和副标题，以便获得更好的SEO体验"
	},
	{
		message:"2019 - 05 - 29",
		reply:"简化footer.php文件结构，将js文件转移到公共main.js文件"
	},
	{
		message:"2019 - 05 - 24",
		reply:"更新脚手架配置。天气炎热，春困夏乏秋无力冬眠呢！"
	},
	{
		message:"2019 - 04 - 26",
		reply:"删除了一些主题静态资源，避免主题看上去臃肿"
	},
	{
		message:"2019 - 04 - 14",
		reply:"后台主题设置新增支持社交账号配置，包括收款二维码上传配置"
	},
	{
		message:"2019 - 04 - 11",
		reply:"连夜修改了一个顽固的bug，你要问多么顽固？它从一开始上线就存在至今，并且遗憾的是我一直知道它的存在，却又束手无策"
	},
	{
		message:"2019 - 04 - 09",
		reply:"感受到视频播放的那一丝流畅吗？静态资源上阿里OSS，又多了一项开支，不过女朋友很是理解我，说也不贵，不会缩减我的伙食费，啦啦啦"
	},
	{
		message:"2019 - 03 - 29",
		reply:"删除了一波无用代码，打包压缩了一波js，减少了一波http请求，网站打开速度又提升了0.001秒，欧耶！"
	},
	{
		message:"2019 - 03 - 20",
		reply:"天地不仁以万物为刍狗，近期网站被莫名持续DDOS攻击，祸不单行，备案也被阿里云吊销了，因之前信息更改没及时更新，一不做二不休，直接购买新的主机，迁移到国外了"
	},
	{
		message:"2019 - 03 - 12",
		reply:"优化文章详情页面的评论模块，侧边评论添加时间"
	},
	{
		message:"2019 - 01 - 22",
		reply:"优化主导航音乐，添加本地存储机制，可选择性打开导航音乐开关，并且保留状态，给用户更多的选择权"
	},
	{
		message:"2018 - 11 - 16",
		reply:"详情页、侧边栏移除畅言，我恨死畅言了，广告多多，请求贼慢，动不动头像出不来js还报错，之所以留言页面还保留，不过是因为去掉后想换原生将改动太大，需要几天功夫，暂时没空折腾"
	},
	{
		message:"2018 - 10 - 02",
		reply:"项目添加gulp构建工具，支持一件打包压缩"
	},
	{
		message:"2018 - 09 - 18",
		reply:"全站全面支持https，更安全更靠谱，哦，更烧钱"
	},
	{
		message:"2018 - 04 - 24",
		reply:"1、去掉垃圾文件，去掉每个分类category.php页面底部多余冗余js 2、优化导航设置高亮方式，改以往笨拙手动设置为在header.php导航中通过is_category判断配置"
	},
	{
		message:"2018 - 04 - 13",
		reply:"新增按下键盘A-L弹钢琴，赶紧试试哦"
	},
	{
		message:"2018 - 03 - 31",
		reply:"强力优化PC端主导航二级菜单UI交互，尤雨溪大师说，学代码也要关注艺术，很对哦"
	},
	{
		message:"2018 - 03 - 16",
		reply:"修复移动端javascript板块页面错乱，此Bug由网友（QQ：1832298856）用户提出（在此感谢），更改侧边栏-大家喜欢栏目排序问题，将之前按评论数量排序规则改为随机"
	},
	{
		message:"2018 - 01 -28",
		reply:"修复在PC端搜索结果页无法点击出现下拉列表和导航音乐播放bug，原因定位：加载了2次公共js文件"
	},
	{
		message:"2017 - 12 -15",
		reply:"完善移动端侧边栏导航，且修复头部在首次加载时候部分设备最开始显示不全bug，原因定位，不应该设置rem固定头部尺寸，而应该直接设置100%，因为在设置rem时候需要等到js计算然后才能正确显示，而在css里设置100%则渲染快N倍。增加点击移动端头部文字“唯品秀博客”跳转到首页"
	},
	{
		message:"2017 - 10 -29",
		reply:"新增，右侧边栏-大家喜欢栏目，仿'妙味课堂'文字琴弦效果（如此说仿，不如说抄袭，谁让我想不出这么奇妙的交互的点子呢）"
	},
	{
		message:"2017 - 08 - 20",
		reply:"意外发现swiper移动端代码并没有正确初始化，但之前页面却一直能正常运行，果真是世界之大、无奇不有？"
	},
	{
		message:"2017 - 06 - 02",
		reply:"留言板页面多说评论框全面崩溃，由此转向畅言，（谁也不知道这玩意儿几时会挂，将就使）"
	},
	{
		message:"2017 - 05 - 19",
		reply:"博客2.0主题全面上线,目标定位：更酷炫、代码更简洁"
	},
	{
		message:"2017 - 02 - 08",
		reply:"独自来上海，开启新的前端之路（一条背井离乡不归之路），看那孤独的背影，不正是成功人士的缩写"
	},
	{
		message:"2017 - 02 - 07",
		reply:"优化SEO排名，新增搜索关键词（貌似都是心理作用，了解那么久SEO，发现要流量还是得烧钱靠谱）"
	},
	{
		message:"2017 - 01 - 20",
		reply:"新增视频播放器，放点啥呢？放个主题使用介绍吧，让更多小伙伴能轻松愉快的使用本主题"
	},
	{
		message:"2017 - 01 - 15",
		reply:"优化开场动画，改jQuery采用CSS3"
	},
	{
		message:"2017 - 01 - 10",
		reply:"新增PC端巨屏首页3D轮播(国外插件改动了下，更适合大屏幕)"
	},
	{
		message:"2017 - 01 - 07",
		reply:"修改音乐播放器，改用插件"
	},
	{
		message:"2017 - 01 - 01",
		reply:"新的一年到来，元旦快乐，在此优化一波音乐UI"
	},
	{
		message:"2016 - 12 - 25",
		reply:"新增用户注册，支持普通用户发表管理文章"
	},
	{
		message:"2016 - 12 - 02",
		reply:"新增3D音乐导航"
	},
	{
		message:"2016 - 11 - 20",
		reply:"兼容移动端适配(ipd无视，一笔带过)"
	},
	{
		message:"2016 - 11 - 17",
		reply:"增加 - '特别鸣谢'页面，感谢有你们，才能让我走的更远！"
	},
	{
		message:"2016 - 11 - 16 博客正式上线!",
		reply:"很高兴在近日不遗余力坚持下，在保持打造高质量博客主题的同时，尽可能做到了兼容IE9，这不仅仅是针对技术的挑战，更是希望尊重、珍惜每一位关注我博客的朋友，绝不希望因为有朋友因为低版本兼容问题遗憾而去放弃尝试使用它。未来，我还会考虑兼容到IE8，未来，我们一路同行，"+"<a href="+window.location.protocol+"//"+window.location.host+"/wp-login.php>"+"登录注册</a>"+"<a href='https://github.com/weipxiu/Art_Blog'>源码仓库地址</a>"
	}
];
